sysbench/zlib/log/oltp_read_write.log
sysbench 1.1.0-faaff4f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 72.66 qps: 1483.67 (r/w/o: 1039.69/82.66/361.32) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 71.60 qps: 1432.04 (r/w/o: 1002.43/80.40/349.21) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 70.10 qps: 1402.02 (r/w/o: 981.42/78.30/342.31) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 76.20 qps: 1524.00 (r/w/o: 1066.80/85.30/371.90) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 78.40 qps: 1558.10 (r/w/o: 1093.70/88.60/375.80) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 76.70 qps: 1543.87 (r/w/o: 1077.68/87.80/378.39) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 79.61 qps: 1592.20 (r/w/o: 1114.54/89.11/388.55) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 78.19 qps: 1563.80 (r/w/o: 1094.66/88.99/380.15) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 77.00 qps: 1540.02 (r/w/o: 1078.01/87.70/374.30) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 75.20 qps: 1503.99 (r/w/o: 1052.79/84.20/367.00) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 73.60 qps: 1472.03 (r/w/o: 1030.42/83.00/358.61) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 79.31 qps: 1586.10 (r/w/o: 1110.27/90.01/385.82) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 16 tps: 76.70 qps: 1533.94 (r/w/o: 1073.76/85.70/374.49) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 16 tps: 76.70 qps: 1534.08 (r/w/o: 1073.85/88.20/372.02) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 16 tps: 81.49 qps: 1629.84 (r/w/o: 1140.89/91.39/397.56) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 16 tps: 78.20 qps: 1564.03 (r/w/o: 1094.82/87.70/381.51) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 16 tps: 84.40 qps: 1687.99 (r/w/o: 1181.59/97.10/409.30) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 16 tps: 83.00 qps: 1660.01 (r/w/o: 1162.01/93.50/404.50) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 16 tps: 85.40 qps: 1707.97 (r/w/o: 1195.58/96.20/416.19) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 16 tps: 81.40 qps: 1627.92 (r/w/o: 1139.54/92.00/396.38) lat (ms,95%): 267.41 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 16 tps: 79.51 qps: 1582.51 (r/w/o: 1111.18/88.31/383.03) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 16 tps: 82.80 qps: 1663.60 (r/w/o: 1161.10/95.20/407.30) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 16 tps: 77.10 qps: 1541.97 (r/w/o: 1079.38/87.00/375.59) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 16 tps: 81.20 qps: 1613.03 (r/w/o: 1131.82/90.90/390.31) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 16 tps: 96.90 qps: 1948.97 (r/w/o: 1361.58/112.30/475.09) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 16 tps: 116.71 qps: 2334.17 (r/w/o: 1633.92/130.31/569.94) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 16 tps: 116.89 qps: 2337.86 (r/w/o: 1636.50/133.89/567.47) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 16 tps: 111.90 qps: 2237.99 (r/w/o: 1566.59/126.90/544.50) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 16 tps: 104.19 qps: 2083.86 (r/w/o: 1458.71/118.89/506.27) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 16 tps: 107.22 qps: 2144.31 (r/w/o: 1501.02/123.32/519.98) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 16 tps: 118.51 qps: 2370.26 (r/w/o: 1659.18/131.41/579.66) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 16 tps: 119.98 qps: 2399.55 (r/w/o: 1679.69/135.57/584.29) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 16 tps: 111.90 qps: 2238.10 (r/w/o: 1566.67/126.91/544.52) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 16 tps: 102.90 qps: 2059.71 (r/w/o: 1441.94/116.89/500.88) lat (ms,95%): 223.34 err/s: 0.10 reconn/s: 0.00
[ 350s ] thds: 16 tps: 113.60 qps: 2273.86 (r/w/o: 1591.84/127.10/554.91) lat (ms,95%): 167.44 err/s: 0.10 reconn/s: 0.00
[ 360s ] thds: 16 tps: 113.60 qps: 2271.94 (r/w/o: 1590.36/129.50/552.08) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 16 tps: 116.80 qps: 2335.97 (r/w/o: 1635.18/131.50/569.29) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 16 tps: 111.90 qps: 2238.00 (r/w/o: 1566.60/126.10/545.30) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 16 tps: 115.10 qps: 2302.03 (r/w/o: 1611.42/133.10/557.51) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 16 tps: 95.10 qps: 1901.90 (r/w/o: 1331.40/109.40/461.10) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 16 tps: 76.80 qps: 1536.18 (r/w/o: 1075.25/86.50/374.42) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 16 tps: 82.19 qps: 1643.89 (r/w/o: 1150.72/93.09/400.07) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 16 tps: 76.90 qps: 1538.03 (r/w/o: 1076.62/88.20/373.21) lat (ms,95%): 292.60 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 16 tps: 104.30 qps: 2086.00 (r/w/o: 1460.20/121.30/504.50) lat (ms,95%): 248.83 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 16 tps: 115.42 qps: 2308.42 (r/w/o: 1615.90/132.72/559.80) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 16 tps: 98.09 qps: 1961.81 (r/w/o: 1373.26/113.79/474.75) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 16 tps: 116.89 qps: 2337.81 (r/w/o: 1636.46/134.79/566.55) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 16 tps: 119.90 qps: 2398.05 (r/w/o: 1678.64/138.10/581.31) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 16 tps: 101.50 qps: 2029.93 (r/w/o: 1420.95/116.30/492.68) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 16 tps: 112.00 qps: 2239.98 (r/w/o: 1567.99/128.90/543.10) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 16 tps: 119.90 qps: 2397.98 (r/w/o: 1678.59/138.80/580.59) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 16 tps: 113.60 qps: 2272.01 (r/w/o: 1590.41/131.50/550.10) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 16 tps: 113.70 qps: 2273.99 (r/w/o: 1591.79/131.00/551.20) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 16 tps: 113.50 qps: 2270.06 (r/w/o: 1589.04/129.30/551.72) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 16 tps: 112.00 qps: 2239.94 (r/w/o: 1567.96/129.10/542.89) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 16 tps: 116.70 qps: 2334.06 (r/w/o: 1633.84/135.50/564.72) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 16 tps: 113.50 qps: 2269.94 (r/w/o: 1588.96/129.50/551.49) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 16 tps: 104.61 qps: 2092.16 (r/w/o: 1464.52/120.61/507.04) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 16 tps: 118.29 qps: 2365.77 (r/w/o: 1656.04/134.69/575.05) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 16 tps: 115.33 qps: 2306.53 (r/w/o: 1614.57/135.13/556.83) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 610s ] thds: 16 tps: 118.48 qps: 2369.53 (r/w/o: 1658.67/136.27/574.59) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 620s ] thds: 16 tps: 113.61 qps: 2272.16 (r/w/o: 1590.51/131.51/550.14) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 630s ] thds: 16 tps: 118.19 qps: 2363.82 (r/w/o: 1654.67/134.19/574.96) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 640s ] thds: 16 tps: 116.90 qps: 2338.04 (r/w/o: 1636.63/133.70/567.71) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 650s ] thds: 16 tps: 115.10 qps: 2301.98 (r/w/o: 1611.38/133.00/557.59) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 660s ] thds: 16 tps: 116.70 qps: 2334.07 (r/w/o: 1633.85/133.90/566.32) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 670s ] thds: 16 tps: 117.20 qps: 2336.53 (r/w/o: 1638.92/134.90/562.71) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 680s ] thds: 16 tps: 112.10 qps: 2249.44 (r/w/o: 1571.26/127.70/550.48) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 690s ] thds: 16 tps: 113.70 qps: 2273.98 (r/w/o: 1591.78/131.70/550.49) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 700s ] thds: 16 tps: 116.82 qps: 2336.36 (r/w/o: 1635.52/136.43/564.41) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 710s ] thds: 16 tps: 118.28 qps: 2365.60 (r/w/o: 1655.85/136.77/572.98) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 720s ] thds: 16 tps: 116.70 qps: 2334.05 (r/w/o: 1633.84/132.00/568.21) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 730s ] thds: 16 tps: 115.30 qps: 2306.02 (r/w/o: 1614.22/135.20/556.61) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 740s ] thds: 16 tps: 119.89 qps: 2397.88 (r/w/o: 1678.52/139.79/579.57) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 750s ] thds: 16 tps: 115.31 qps: 2306.22 (r/w/o: 1614.36/135.01/556.85) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 760s ] thds: 16 tps: 113.71 qps: 2273.59 (r/w/o: 1591.70/129.92/551.97) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 770s ] thds: 16 tps: 116.68 qps: 2334.20 (r/w/o: 1633.75/137.47/562.98) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 780s ] thds: 16 tps: 113.70 qps: 2274.06 (r/w/o: 1591.84/131.90/550.31) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 790s ] thds: 16 tps: 114.90 qps: 2298.00 (r/w/o: 1608.60/132.80/556.60) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 800s ] thds: 16 tps: 121.50 qps: 2429.50 (r/w/o: 1701.00/140.80/587.70) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 810s ] thds: 16 tps: 116.90 qps: 2338.47 (r/w/o: 1636.58/134.10/567.79) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 820s ] thds: 16 tps: 118.40 qps: 2368.03 (r/w/o: 1657.62/137.70/572.71) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 830s ] thds: 16 tps: 115.21 qps: 2304.21 (r/w/o: 1612.95/134.41/556.85) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 840s ] thds: 16 tps: 118.39 qps: 2367.78 (r/w/o: 1657.44/140.09/570.25) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 850s ] thds: 16 tps: 113.70 qps: 2273.97 (r/w/o: 1591.78/131.70/550.49) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 860s ] thds: 16 tps: 115.10 qps: 2302.03 (r/w/o: 1611.42/134.50/556.11) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 870s ] thds: 16 tps: 115.30 qps: 2306.00 (r/w/o: 1614.20/134.50/557.30) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 880s ] thds: 16 tps: 115.12 qps: 2302.43 (r/w/o: 1611.70/135.73/555.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 890s ] thds: 16 tps: 113.58 qps: 2271.53 (r/w/o: 1590.07/133.37/548.09) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 900s ] thds: 16 tps: 113.70 qps: 2274.00 (r/w/o: 1591.80/132.10/550.10) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 910s ] thds: 16 tps: 118.30 qps: 2366.04 (r/w/o: 1656.22/139.00/570.81) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 920s ] thds: 16 tps: 116.70 qps: 2334.00 (r/w/o: 1633.80/137.70/562.50) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 930s ] thds: 16 tps: 116.80 qps: 2335.94 (r/w/o: 1635.16/136.90/563.89) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 940s ] thds: 16 tps: 118.40 qps: 2368.06 (r/w/o: 1657.64/141.20/569.21) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 950s ] thds: 16 tps: 113.29 qps: 2244.78 (r/w/o: 1570.01/132.59/542.17) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 960s ] thds: 16 tps: 117.21 qps: 2364.84 (r/w/o: 1657.00/138.51/569.33) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 970s ] thds: 16 tps: 105.90 qps: 2118.34 (r/w/o: 1482.56/125.50/510.29) lat (ms,95%): 240.02 err/s: 0.00 reconn/s: 0.00
[ 980s ] thds: 16 tps: 116.70 qps: 2334.06 (r/w/o: 1633.84/138.20/562.01) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 990s ] thds: 16 tps: 113.70 qps: 2273.97 (r/w/o: 1591.78/134.50/547.69) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1000s ] thds: 16 tps: 115.10 qps: 2302.04 (r/w/o: 1611.43/136.10/554.51) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1010s ] thds: 16 tps: 116.70 qps: 2333.97 (r/w/o: 1633.78/139.10/561.09) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1020s ] thds: 16 tps: 121.60 qps: 2431.95 (r/w/o: 1702.37/146.60/582.99) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1030s ] thds: 16 tps: 118.30 qps: 2366.07 (r/w/o: 1656.25/140.00/569.82) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1040s ] thds: 16 tps: 116.80 qps: 2336.00 (r/w/o: 1635.20/138.00/562.80) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1050s ] thds: 16 tps: 115.20 qps: 2303.97 (r/w/o: 1612.78/136.00/555.19) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1060s ] thds: 16 tps: 116.80 qps: 2336.03 (r/w/o: 1635.22/137.70/563.11) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1070s ] thds: 16 tps: 112.10 qps: 2242.00 (r/w/o: 1569.40/132.40/540.20) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1080s ] thds: 16 tps: 113.60 qps: 2272.00 (r/w/o: 1590.40/134.10/547.50) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1090s ] thds: 16 tps: 110.40 qps: 2207.97 (r/w/o: 1545.58/129.10/533.29) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1100s ] thds: 16 tps: 112.00 qps: 2240.03 (r/w/o: 1568.02/132.20/539.81) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1110s ] thds: 16 tps: 113.50 qps: 2269.96 (r/w/o: 1588.97/134.90/546.09) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1120s ] thds: 16 tps: 113.60 qps: 2272.04 (r/w/o: 1590.43/135.20/546.41) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1130s ] thds: 16 tps: 116.80 qps: 2335.96 (r/w/o: 1635.17/139.00/561.79) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1140s ] thds: 16 tps: 115.30 qps: 2305.95 (r/w/o: 1614.17/136.90/554.89) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1150s ] thds: 16 tps: 113.80 qps: 2276.08 (r/w/o: 1593.26/134.70/548.12) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 1160s ] thds: 16 tps: 115.10 qps: 2301.93 (r/w/o: 1611.35/137.00/553.58) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1170s ] thds: 16 tps: 115.40 qps: 2308.04 (r/w/o: 1615.63/136.20/556.21) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1180s ] thds: 16 tps: 115.20 qps: 2304.03 (r/w/o: 1612.82/138.20/553.01) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1190s ] thds: 16 tps: 113.60 qps: 2271.95 (r/w/o: 1590.37/135.30/546.29) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1200s ] thds: 16 tps: 112.00 qps: 2239.65 (r/w/o: 1568.03/132.70/538.91) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1210s ] thds: 16 tps: 113.60 qps: 2274.13 (r/w/o: 1591.75/135.10/547.28) lat (ms,95%): 167.44 err/s: 0.10 reconn/s: 0.00
[ 1220s ] thds: 16 tps: 118.31 qps: 2366.21 (r/w/o: 1656.35/140.11/569.75) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1230s ] thds: 16 tps: 113.69 qps: 2273.86 (r/w/o: 1591.70/136.49/545.67) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 1240s ] thds: 16 tps: 116.90 qps: 2337.96 (r/w/o: 1636.57/140.90/560.49) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1250s ] thds: 16 tps: 115.10 qps: 2302.01 (r/w/o: 1611.40/137.10/553.50) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1260s ] thds: 16 tps: 115.32 qps: 2306.47 (r/w/o: 1614.53/138.93/553.01) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1270s ] thds: 16 tps: 115.38 qps: 2307.52 (r/w/o: 1615.26/138.07/554.18) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1280s ] thds: 16 tps: 115.10 qps: 2301.94 (r/w/o: 1611.36/137.30/553.29) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 1290s ] thds: 16 tps: 113.60 qps: 2272.08 (r/w/o: 1590.45/137.00/544.62) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 1300s ] thds: 16 tps: 112.10 qps: 2242.03 (r/w/o: 1569.42/137.00/535.61) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1310s ] thds: 16 tps: 110.50 qps: 2210.00 (r/w/o: 1547.00/131.10/531.90) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 1320s ] thds: 16 tps: 113.50 qps: 2270.00 (r/w/o: 1589.00/134.80/546.20) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1330s ] thds: 16 tps: 112.10 qps: 2241.98 (r/w/o: 1569.39/134.50/538.10) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1340s ] thds: 16 tps: 112.00 qps: 2240.02 (r/w/o: 1568.01/133.00/539.00) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1350s ] thds: 16 tps: 113.60 qps: 2272.00 (r/w/o: 1590.40/137.50/544.10) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1360s ] thds: 16 tps: 115.20 qps: 2304.00 (r/w/o: 1612.80/138.10/553.10) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 1370s ] thds: 16 tps: 115.20 qps: 2303.97 (r/w/o: 1612.78/136.80/554.39) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1380s ] thds: 16 tps: 115.30 qps: 2305.96 (r/w/o: 1614.17/137.70/554.09) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1390s ] thds: 16 tps: 116.70 qps: 2334.07 (r/w/o: 1633.85/142.20/558.02) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1400s ] thds: 16 tps: 116.81 qps: 2336.19 (r/w/o: 1635.33/142.91/557.95) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1410s ] thds: 16 tps: 115.10 qps: 2302.03 (r/w/o: 1611.42/139.00/551.61) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1420s ] thds: 16 tps: 113.79 qps: 2275.77 (r/w/o: 1593.04/138.29/544.44) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 1430s ] thds: 16 tps: 115.10 qps: 2302.02 (r/w/o: 1611.42/141.20/549.41) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1440s ] thds: 16 tps: 112.00 qps: 2240.00 (r/w/o: 1568.00/135.00/537.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1450s ] thds: 16 tps: 116.90 qps: 2337.94 (r/w/o: 1636.56/141.60/559.79) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 1460s ] thds: 16 tps: 113.50 qps: 2270.06 (r/w/o: 1589.04/135.70/545.31) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1470s ] thds: 16 tps: 112.10 qps: 2242.10 (r/w/o: 1569.47/131.81/540.82) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1480s ] thds: 16 tps: 115.20 qps: 2303.90 (r/w/o: 1612.73/140.49/550.68) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1490s ] thds: 16 tps: 116.80 qps: 2335.94 (r/w/o: 1635.16/143.50/557.29) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1500s ] thds: 16 tps: 121.50 qps: 2430.06 (r/w/o: 1701.04/146.70/582.31) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1510s ] thds: 16 tps: 121.50 qps: 2430.01 (r/w/o: 1701.00/146.70/582.30) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 1520s ] thds: 16 tps: 118.40 qps: 2368.00 (r/w/o: 1657.60/141.90/568.50) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1530s ] thds: 16 tps: 113.70 qps: 2273.97 (r/w/o: 1591.78/135.50/546.69) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1540s ] thds: 16 tps: 112.00 qps: 2240.03 (r/w/o: 1568.02/134.50/537.51) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 1550s ] thds: 16 tps: 110.40 qps: 2208.00 (r/w/o: 1545.60/132.30/530.10) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1560s ] thds: 16 tps: 115.20 qps: 2304.00 (r/w/o: 1612.80/140.30/550.90) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1570s ] thds: 16 tps: 116.70 qps: 2333.96 (r/w/o: 1633.77/143.60/556.59) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1580s ] thds: 16 tps: 116.80 qps: 2326.25 (r/w/o: 1631.37/139.70/555.19) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1590s ] thds: 16 tps: 115.20 qps: 2313.69 (r/w/o: 1616.59/142.50/554.60) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1600s ] thds: 16 tps: 116.90 qps: 2338.10 (r/w/o: 1636.67/141.81/559.62) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1610s ] thds: 16 tps: 118.42 qps: 2350.84 (r/w/o: 1646.31/142.93/561.60) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1620s ] thds: 16 tps: 116.78 qps: 2352.56 (r/w/o: 1646.49/141.07/565.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1630s ] thds: 16 tps: 113.50 qps: 2270.60 (r/w/o: 1589.00/137.20/544.40) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 1640s ] thds: 16 tps: 115.30 qps: 2306.00 (r/w/o: 1614.20/141.00/550.80) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1650s ] thds: 16 tps: 112.00 qps: 2239.97 (r/w/o: 1567.98/136.80/535.19) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 1660s ] thds: 16 tps: 113.60 qps: 2271.96 (r/w/o: 1590.38/138.10/543.49) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1670s ] thds: 16 tps: 115.30 qps: 2306.02 (r/w/o: 1614.22/141.70/550.11) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1680s ] thds: 16 tps: 111.90 qps: 2238.04 (r/w/o: 1566.62/136.80/534.61) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1690s ] thds: 16 tps: 121.60 qps: 2431.98 (r/w/o: 1702.38/149.40/580.19) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 1700s ] thds: 16 tps: 115.20 qps: 2302.98 (r/w/o: 1612.19/140.60/550.19) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1710s ] thds: 16 tps: 121.50 qps: 2430.98 (r/w/o: 1701.59/148.60/580.80) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1720s ] thds: 16 tps: 116.80 qps: 2336.06 (r/w/o: 1635.24/143.50/557.31) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1730s ] thds: 16 tps: 116.90 qps: 2337.97 (r/w/o: 1636.58/142.80/558.59) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1740s ] thds: 16 tps: 113.50 qps: 2270.04 (r/w/o: 1589.02/137.60/543.41) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1750s ] thds: 16 tps: 121.60 qps: 2432.00 (r/w/o: 1702.40/147.00/582.60) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 1760s ] thds: 16 tps: 116.60 qps: 2332.00 (r/w/o: 1632.40/142.80/556.80) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 1770s ] thds: 16 tps: 113.70 qps: 2273.97 (r/w/o: 1591.78/139.40/542.79) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 1780s ] thds: 16 tps: 115.10 qps: 2302.03 (r/w/o: 1611.42/140.10/550.51) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 1790s ] thds: 16 tps: 115.20 qps: 2303.94 (r/w/o: 1612.76/140.60/550.59) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 1800s ] thds: 16 tps: 115.20 qps: 2304.07 (r/w/o: 1612.85/142.10/549.12) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2750342
        write:                           230887
        other:                           947825
        total:                           3929054
    transactions:                        196450 (109.13 per sec.)
    queries:                             3929054 (2182.68 per sec.)
    ignored errors:                      3      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      109.1324
    time elapsed:                        1800.1067s
    total number of events:              196450

Latency (ms):
         min:                                   83.10
         avg:                                  146.61
         max:                                  818.39
         95th percentile:                      207.82
         sum:                             28800772.41

Threads fairness:
    events (avg/stddev):           12278.1250/6.09
    execution time (avg/stddev):   1800.0483/0.01